{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-a7fb7b1414ff>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "elu", "nb_row": 5, "bias": true, "name": "convolution2d_1", "border_mode": "valid", "nb_col": 5, "b_constraint": null, "nb_filter": 24, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "elu", "nb_row": 5, "bias": true, "name": "convolution2d_2", "border_mode": "valid", "nb_col": 5, "b_constraint": null, "nb_filter": 36, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "elu", "nb_row": 5, "bias": true, "name": "convolution2d_3", "border_mode": "valid", "nb_col": 5, "b_constraint": null, "nb_filter": 48, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "elu", "nb_row": 3, "bias": true, "name": "convolution2d_4", "border_mode": "valid", "nb_col": 3, "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "elu", "nb_row": 3, "bias": true, "name": "convolution2d_5", "border_mode": "valid", "nb_col": 3, "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "output_dim": 100, "trainable": true, "activation": "elu", "name": "dense_1", "init": "glorot_uniform", "bias": true, "b_constraint": null, "input_dim": 1152, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 50, "trainable": true, "activation": "elu", "name": "dense_2", "init": "glorot_uniform", "bias": true, "b_constraint": null, "input_dim": 100, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 10, "trainable": true, "activation": "elu", "name": "dense_3", "init": "glorot_uniform", "bias": true, "b_constraint": null, "input_dim": 50, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "output_dim": 1, "trainable": true, "activation": "linear", "name": "dense_4", "init": "glorot_uniform", "bias": true, "b_constraint": null, "input_dim": 10, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}