{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape": null, "arguments": {}, "name": "lambda_5", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-67-82e0f88974e2>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_21", "activity_regularizer": null, "nb_filter": 24, "activation": "elu", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_22", "activity_regularizer": null, "nb_filter": 36, "activation": "elu", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_23", "activity_regularizer": null, "nb_filter": 48, "activation": "elu", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_24", "activity_regularizer": null, "nb_filter": 64, "activation": "elu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_25", "activity_regularizer": null, "nb_filter": 64, "activation": "elu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_9"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 100, "W_constraint": null, "name": "dense_17", "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "input_dim": 1152, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 50, "W_constraint": null, "name": "dense_18", "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "input_dim": 100, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 10, "W_constraint": null, "name": "dense_19", "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "input_dim": 50, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_10"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1, "W_constraint": null, "name": "dense_20", "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "input_dim": 10, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}], "keras_version": "1.2.1"}