{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "input_dtype": "float32", "name": "lambda_2", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-35-30ef0e8deb76>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_filter": 24, "name": "convolution2d_6", "W_regularizer": null, "trainable": true, "nb_col": 5, "activation": "elu", "bias": true, "subsample": [2, 2], "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_filter": 36, "name": "convolution2d_7", "W_regularizer": null, "trainable": true, "nb_col": 5, "activation": "elu", "bias": true, "subsample": [2, 2], "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "name": "convolution2d_8", "W_regularizer": null, "trainable": true, "nb_col": 5, "activation": "elu", "bias": true, "subsample": [2, 2], "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "name": "convolution2d_9", "W_regularizer": null, "trainable": true, "nb_col": 3, "activation": "elu", "bias": true, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "name": "convolution2d_10", "W_regularizer": null, "trainable": true, "nb_col": 3, "activation": "elu", "bias": true, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 1152, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "name": "dense_5", "W_regularizer": null, "bias": true, "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "name": "dense_6", "W_regularizer": null, "bias": true, "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "name": "dense_7", "W_regularizer": null, "bias": true, "activation": "elu", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "name": "dense_8", "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true}}]}